{
  "@odata.context": "https://graph.microsoft.us/v1.0/$metadata#deviceAppManagement/managedAppPolicies",
  "value": [
    {
      "@odata.type": "#microsoft.graph.iosManagedAppProtection",
      "id": "00000000-0000-0000-0000-000000000501",
      "displayName": "iOS App Protection Policy",
      "description": "CMMC L2 data protection for iOS devices",
      "createdDateTime": "2024-06-01T10:00:00Z",
      "lastModifiedDateTime": "2025-03-19T14:30:00Z",
      "version": "v1",
      "isAssigned": true,
      "targetedAppManagementLevels": "unmanaged",
      "periodOfflineBeforeAccessCheck": "PT5M",
      "periodOnlineBeforeAccessCheck": "PT30S",
      "allowedInboundDataTransferSources": "managedApps",
      "allowedOutboundDataTransferDestinations": "managedApps",
      "contactITName": "IT Support",
      "contactITPhoneNumber": "+1-555-0100",
      "contactITEmailAddress": "itsupport@contoso-defense.com",
      "displayContactITWhenAppCannotBeManaged": true,
      "remoteAssistanceIsEnabled": true,
      "isRoleScopingEnabled": false,
      "dataBackupBlocked": true,
      "deviceComplianceRequired": true,
      "managedBrowser": "microsoftEdge",
      "minimumRequiredCompanyPortalVersion": "5.2003.1",
      "minimumWarningCompanyPortalVersion": "5.2003.1",
      "minimumRequiredAppVersion": "5.0",
      "minimumWarningAppVersion": "5.0",
      "minimumRequiredOSVersion": "14.0",
      "minimumWarningOSVersion": "14.0",
      "exemptedAppProtocols": [],
      "exemptedAppPackages": [],
      "appActionIfDeviceComplianceRequired": "block",
      "appActionIfMaximumPinRetriesExceeded": "block",
      "pinRequired": true,
      "maximumPinRetries": 5,
      "simplePinBlocked": false,
      "minimumPinLength": 6,
      "pinCharacterSet": "numeric",
      "biometricAuthenticationBlocked": false,
      "requireClass3Biometrics": false,
      "requirePinAfterBiometricChange": true,
      "fingerprintBlocked": false,
      "disableAppPinIfDevicePinIsSet": false,
      "screenCaptureBlocked": true,
      "printBlocked": true,
      "allowedDataStorageLocations": [
        "sharePoint"
      ],
      "allowedIosDeviceModels": [],
      "appGroupVersion": null,
      "minimumRequiredSdkVersion": "14.0",
      "deployedAppCount": 5,
      "faceIdBlocked": false,
      "encryptAppData": true,
      "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
      "appDataEncryptionType": "whenDeviceLocked"
    },
    {
      "@odata.type": "#microsoft.graph.androidManagedAppProtection",
      "id": "00000000-0000-0000-0000-000000000502",
      "displayName": "Android App Protection Policy",
      "description": "CMMC L2 data protection for Android devices",
      "createdDateTime": "2024-06-02T10:00:00Z",
      "lastModifiedDateTime": "2025-03-19T14:30:00Z",
      "version": "v1",
      "isAssigned": true,
      "targetedAppManagementLevels": "unmanaged",
      "periodOfflineBeforeAccessCheck": "PT5M",
      "periodOnlineBeforeAccessCheck": "PT30S",
      "allowedInboundDataTransferSources": "managedApps",
      "allowedOutboundDataTransferDestinations": "managedApps",
      "contactITName": "IT Support",
      "contactITPhoneNumber": "+1-555-0100",
      "contactITEmailAddress": "itsupport@contoso-defense.com",
      "displayContactITWhenAppCannotBeManaged": true,
      "remoteAssistanceIsEnabled": true,
      "isRoleScopingEnabled": false,
      "dataBackupBlocked": true,
      "deviceComplianceRequired": true,
      "managedBrowser": "microsoftEdge",
      "minimumRequiredCompanyPortalVersion": "5.2003.1",
      "minimumWarningCompanyPortalVersion": "5.2003.1",
      "minimumRequiredAppVersion": "5.0",
      "minimumWarningAppVersion": "5.0",
      "minimumRequiredOSVersion": "11.0",
      "minimumWarningOSVersion": "11.0",
      "exemptedAppProtocols": [],
      "exemptedAppPackages": [],
      "appActionIfDeviceComplianceRequired": "block",
      "appActionIfMaximumPinRetriesExceeded": "block",
      "pinRequired": true,
      "maximumPinRetries": 5,
      "simplePinBlocked": false,
      "minimumPinLength": 6,
      "pinCharacterSet": "numeric",
      "biometricAuthenticationBlocked": false,
      "requireStrongBiometric": true,
      "screenCaptureBlocked": true,
      "printBlocked": true,
      "allowedDataStorageLocations": [
        "sharePoint"
      ],
      "allowedAndroidDeviceManufacturers": [],
      "appGroupVersion": null,
      "minimumRequiredSdkVersion": "11.0",
      "deployedAppCount": 5,
      "encryptAppData": true,
      "appDataEncryptionType": "whenDeviceLocked",
      "customBrowser": "com.android.chrome"
    },
    {
      "@odata.type": "#microsoft.graph.windowsManagedAppProtection",
      "id": "00000000-0000-0000-0000-000000000503",
      "displayName": "Windows App Protection Policy",
      "description": "CMMC L2 data protection for Windows devices",
      "createdDateTime": "2024-06-03T10:00:00Z",
      "lastModifiedDateTime": "2025-03-19T14:30:00Z",
      "version": "v1",
      "isAssigned": true,
      "targetedAppManagementLevels": "unmanaged",
      "periodOfflineBeforeAccessCheck": "PT5M",
      "periodOnlineBeforeAccessCheck": "PT30S",
      "allowedInboundDataTransferSources": "managedApps",
      "allowedOutboundDataTransferDestinations": "managedApps",
      "contactITName": "IT Support",
      "contactITPhoneNumber": "+1-555-0100",
      "contactITEmailAddress": "itsupport@contoso-defense.com",
      "displayContactITWhenAppCannotBeManaged": true,
      "remoteAssistanceIsEnabled": true,
      "isRoleScopingEnabled": false,
      "dataBackupBlocked": true,
      "deviceComplianceRequired": true,
      "managedBrowser": "microsoftEdge",
      "minimumRequiredCompanyPortalVersion": "5.2003.1",
      "minimumWarningCompanyPortalVersion": "5.2003.1",
      "minimumRequiredAppVersion": "5.0",
      "minimumWarningAppVersion": "5.0",
      "minimumRequiredOSVersion": "11.0",
      "minimumWarningOSVersion": "11.0",
      "exemptedAppProtocols": [],
      "exemptedAppPackages": [],
      "appActionIfDeviceComplianceRequired": "block",
      "deployedAppCount": 5,
      "encryptAppData": true,
      "appDataEncryptionType": "whenDeviceLocked"
    }
  ]
}
